import 'dart:io';

void main() {
  print('вам слово');

  // + - * /
  print(1 + 1);
  print(1 - 1.5);
  print(1 * 1);
  print(1 / 1);

  print('строка 1' + ' строка 2');
  print(' строка 3' * 5);

  stdout.write('строка 4');
  stdout.write('строка 5');

  print('1 + 1 = ${1 + 1} что-то написать');
  print('1 - 1.5 = ${1 - 1.5}');
  print('1 * 1 = ${1 * 1}');
  print('1 / 1 = ${1 / 1}');

  print('слово 1  слово 2');
  print('слово 1\t\tслово 2');
  print('слово 1\n слово 2');
  print('слово 1 \' слово 2');
  print('слово 1 \\ слово 2');
}





// import 'dart:io';
//
// void main() {
//   // // + - * /
//   // print(1 + 0.5);
//   // print(1 - 5);
//   // print(-4 * 2);
//   // print(1 / 1);
//
//   print('строка 1' + 'строка 2');
//   print(' строка 3' * 7);
//   //
//   // print('Фамилия\t\tИмя');
//   // print('Абдуллаев\tГамзат');
//   // print('Халидов\t\tАхмед');
//   // print('Халидов\\ Ахмед');
//   // print('Халидов\n Ахмед');
//   //
//   // stdout.write('строка 4');
//   // stdout.write(' строка 5');
// }
