import 'dart:io';

void main() {
  // // z1
  // stdout.write('Введите дробное число: ');
  // double num1 = double.parse(stdin.readLineSync().toString());
  // print('$num1 рублей – это ${num1 ~/1} руб. ${num1 * 100 % 100 ~/1} коп.');

  // z3
  // Обмен переменных значениями. Создайте две целочисленные переменные
  // и присвойте им произвольные значения.
  // Напишите код, который обменяет значение этих переменных.
  // Решите двумя способами:
  // 3.1 используя третью переменную для обмена значений
  // 3.2 используя операции сложения и вычитания
  //
  // int num31 = 8, num32 = 26;
  //
  // // // z3.1
  // int oldNum;
  // oldNum = num31; // 5
  // num31 = num32;  // 26
  // num32 = oldNum; // 5
  //
  // // // z3.2
  // num31 = num31 + num32; // 34
  // num32 = num31 - num32; // 34 - 26 = 8
  // num31 = num31 - num32; // 34 - 8 = 26
  // print('$num31, $num32');

  // // z5 (2957)
  // print( (8 % 2)*(2 % 8) + 1 );
}
